{
  "architectures": ["Grok1ForCausalLM"],
  "model_type": "grok1",
  "hidden_size": 8192,
  "num_hidden_layers": 64,
  "num_attention_heads": 64,
  "head_dim": 128,
  "num_key_value_heads": 8,
  "intermediate_size": 32768,
  "moe_intermediate_size": 16384,
  "num_local_experts": 8,
  "num_experts_per_tok": 2,
  "residual_moe": true,
  "rms_norm_eps": 1e-5,
  "torch_dtype": "bfloat16",
  "original_max_position_embeddings": 8192,
  "scaling_factor": 16.0,
  "max_position_embeddings": 131072,
  "rope_type": "original",
  "rope_theta": 208533496,
  "attn_temperature_len": 1024,
  "attn_logit_softcapping": 30.0,
  "router_logit_softcapping": 30.0,
  "final_logit_softcapping": 50.0,
  "embedding_multiplier_scale": 1.0,
  "output_multiplier_scale": 1.0,
  "vocab_size": 131072,
  "tokenizer_name_or_path": "path/to/tokenizer.tok.json"
}
